espressif/esp-idf/components/soc/esp32s31/register/soc/mcpwm_struct.h
/** Type of fhn_cfg0 register
 *  PWMn A and PWMn B trip events actions configuration register
 */
typedef union {
    struct {
        /** tzn_sw_cbc : R/W; bitpos: [0]; default: 0;
         *  Configures whether or not to enable software force cycle-by-cycle mode action.
         *  0: Disable
         *  1: Enable
         */
        uint32_t tzn_sw_cbc:1;
        /** tzn_f2_cbc : R/W; bitpos: [1]; default: 0;
         *  Configures whether or not event_f2 will trigger cycle-by-cycle mode action.
         *  0: Disable
         *  1: Enable
         */
        uint32_t tzn_f2_cbc:1;
        /** tzn_f1_cbc : R/W; bitpos: [2]; default: 0;
         *  Configures whether or not event_f1 will trigger cycle-by-cycle mode action.
         *  0: Disable
         *  1: Enable
         */
        uint32_t tzn_f1_cbc:1;
        /** tzn_f0_cbc : R/W; bitpos: [3]; default: 0;
         *  Configures whether or not event_f0 will trigger cycle-by-cycle mode action.
         *  0: Disable
         *  1: Enable
         */
        uint32_t tzn_f0_cbc:1;
        /** tzn_sw_ost : R/W; bitpos: [4]; default: 0;
         *  Configures whether or not to enable software force one-shot mode action.
         *  0: Disable
         *  1: Enable
         */
        uint32_t tzn_sw_ost:1;
        /** tzn_f2_ost : R/W; bitpos: [5]; default: 0;
         *  Configures whether or not event_f2 will trigger one-shot mode action.
         *  0: Disable
         *  1: Enable
         */
        uint32_t tzn_f2_ost:1;
        /** tzn_f1_ost : R/W; bitpos: [6]; default: 0;
         *  Configures whether or not event_f1 will trigger one-shot mode action.
         *  0: Disable
         *  1: Enable
         */
        uint32_t tzn_f1_ost:1;
        /** tzn_f0_ost : R/W; bitpos: [7]; default: 0;
         *  Configures whether or not event_f0 will trigger one-shot mode action.
         *  0: Disable
         *  1: Enable
         */
        uint32_t tzn_f0_ost:1;
        /** tzn_a_cbc_d : R/W; bitpos: [9:8]; default: 0;
         *  Configures cycle-by-cycle mode action on PWMn A when fault event occurs and timer
         *  is decreasing.
         *  0: Do nothing
         *  1: Force low
         *  2: Force high
         *  3: Toggle
         */
        uint32_t tzn_a_cbc_d:2;
        /** tzn_a_cbc_u : R/W; bitpos: [11:10]; default: 0;
         *  Configures cycle-by-cycle mode action on PWMn A when fault event occurs and timer
         *  is increasing.
         *  0: Do nothing
         *  1: Force low
         *  2: Force high
         *  3: Toggle
         */
        uint32_t tzn_a_cbc_u:2;
        /** tzn_a_ost_d : R/W; bitpos: [13:12]; default: 0;
         *  Configures one-shot mode action on PWMn A when fault event occurs and timer is
         *  decreasing.
         *  0: Do nothing
         *  1: Force low
         *  2: Force high
         *  3: Toggle
         */
        uint32_t tzn_a_ost_d:2;
        /** tzn_a_ost_u : R/W; bitpos: [15:14]; default: 0;
         *  Configures one-shot mode action on PWMn A when fault event occurs and timer is
         *  increasing.
         *  0: Do nothing
         *  1: Force low
         *  2: Force high
         *  3: Toggle
         */
        uint32_t tzn_a_ost_u:2;
        /** tzn_b_cbc_d : R/W; bitpos: [17:16]; default: 0;
         *  Configures cycle-by-cycle mode action on PWMn B when fault event occurs and timer
         *  is decreasing.
         *  0: Do nothing
         *  1: Force low
         *  2: Force high
         *  3: Toggle
         */
        uint32_t tzn_b_cbc_d:2;
        /** tzn_b_cbc_u : R/W; bitpos: [19:18]; default: 0;
         *  Configures cycle-by-cycle mode action on PWMn B when fault event occurs and timer
         *  is increasing.
         *  0: Do nothing
         *  1: Force low
         *  2: Force high
         *  3: Toggle
         */
        uint32_t tzn_b_cbc_u:2;
        /** tzn_b_ost_d : R/W; bitpos: [21:20]; default: 0;
         *  Configures one-shot mode action on PWMn B when fault event occurs and timer is
         *  decreasing.
         *  0: Do nothing
         *  1: Force low
         *  2: Force high
         *  3: Toggle
         */
        uint32_t tzn_b_ost_d:2;
        /** tzn_b_ost_u : R/W; bitpos: [23:22]; default: 0;
         *  Configures one-shot mode action on PWMn B when fault event occurs and timer is
         *  increasing.
         *  0: Do nothing
         *  1: Force low
         *  2: Force high
         *  3: Toggle
         */
        uint32_t tzn_b_ost_u:2;
        uint32_t reserved_24:8;
    };
    uint32_t val;
} mcpwm_fhn_cfg0_reg_t;

/** Type of fhn_cfg1 register
 *  Software triggers for fault handler actions configuration register
 */
typedef union {
    struct {
        /** tzn_clr_ost : R/W; bitpos: [0]; default: 0;
         *  Configures the generation of software one-shot mode action clear. A toggle
         *  (software negate its value) triggers a clear for on going one-shot mode action.
         */
        uint32_t tzn_clr_ost:1;
        /** tzn_cbcpulse : R/W; bitpos: [2:1]; default: 0;
         *  Configures the refresh moment selection of cycle-by-cycle mode action.
         *  0: Select nothing, will not refresh
         *  Bit0 is set to 1: TEZ
         *  Bit1 is set to 1: TEP
         */
        uint32_t tzn_cbcpulse:2;
        /** tzn_force_cbc : R/W; bitpos: [3]; default: 0;
         *  Configures the generation of software cycle-by-cycle mode action. A toggle
         *  (software negate its value) triggers a cycle-by-cycle mode action.
         */
        uint32_t tzn_force_cbc:1;
        /** tzn_force_ost : R/W; bitpos: [4]; default: 0;
         *  Configures the generation of software one-shot mode action. A toggle (software
         *  negate its value) triggers a one-shot mode action.
         */
        uint32_t tzn_force_ost:1;
        uint32_t reserved_5:27;
    };
    uint32_t val;
} mcpwm_fhn_cfg1_reg_t;

/** Type of fault_detect register
 *  Fault detection configuration and status register
 */
typedef union {
    struct {
        /** f0_en : R/W; bitpos: [0]; default: 0;
         *  Configures whether or not to enable event_f0 generation.
         *  0: Disable
         *  1: Enable
         */
        uint32_t f0_en:1;
        /** f1_en : R/W; bitpos: [1]; default: 0;
         *  Configures whether or not to enable event_f1 generation.
         *  0: Disable
         *  1: Enable
         */
        uint32_t f1_en:1;
        /** f2_en : R/W; bitpos: [2]; default: 0;
         *  Configures whether or not to enable event_f2 generation.
         *  0: Disable
         *  1: Enable
         */
        uint32_t f2_en:1;
        /** f0_pole : R/W; bitpos: [3]; default: 0;
         *  Configures event_f0 trigger polarity on FAULT0 source from GPIO matrix.
         *  0: Level low
         *  1: Level high
         */
        uint32_t f0_pole:1;
        /** f1_pole : R/W; bitpos: [4]; default: 0;
         *  Configures event_f1 trigger polarity on FAULT1 source from GPIO matrix.
         *  0: Level low
         *  1: Level high
         */
        uint32_t f1_pole:1;
        /** f2_pole : R/W; bitpos: [5]; default: 0;
         *  Configures event_f2 trigger polarity on FAULT2 source from GPIO matrix.
         *  0: Level low
         *  1: Level high
         */
        uint32_t f2_pole:1;
        /** event_f0 : RO; bitpos: [6]; default: 0;
         *  Represents whether or not an event_f0 is on going.
         *  0: No action
         *  1: On going
         */
        uint32_t event_f0:1;
        /** event_f1 : RO; bitpos: [7]; default: 0;
         *  Represents whether or not an event_f1 is on going.
         *  0: No action
         *  1: On going
         */
        uint32_t event_f1:1;
        /** event_f2 : RO; bitpos: [8]; default: 0;
         *  Represents whether or not an event_f2 is on going.
         *  0: No action
         *  1: On going
         */
        uint32_t event_f2:1;
        uint32_t reserved_9:23;
    };
    uint32_t val;
} mcpwm_fault_detect_reg_t;

