espressif/esp-idf/components/soc/esp32s31/register/soc/mcpwm_struct.h
/** Type of task_en register
 *  Task enable register
 */
typedef union {
    struct {
        /** task_cmpr0_a_up_en : R/W; bitpos: [0]; default: 0;
         *  Configures whether or not to enable PWM generator0 timer stamp A's shadow register
         *  update task receive.
         *  0: Disable
         *  1: Enable
         */
        uint32_t task_cmpr0_a_up_en:1;
        /** task_cmpr1_a_up_en : R/W; bitpos: [1]; default: 0;
         *  Configures whether or not to enable PWM generator1 timer stamp A's shadow register
         *  update task receive.
         *  0: Disable
         *  1: Enable
         */
        uint32_t task_cmpr1_a_up_en:1;
        /** task_cmpr2_a_up_en : R/W; bitpos: [2]; default: 0;
         *  Configures whether or not to enable PWM generator2 timer stamp A's shadow register
         *  update task receive.
         *  0: Disable
         *  1: Enable
         */
        uint32_t task_cmpr2_a_up_en:1;
        /** task_cmpr0_b_up_en : R/W; bitpos: [3]; default: 0;
         *  Configures whether or not to enable PWM generator0 timer stamp B's shadow register
         *  update task receive.
         *  0: Disable
         *  1: Enable
         */
        uint32_t task_cmpr0_b_up_en:1;
        /** task_cmpr1_b_up_en : R/W; bitpos: [4]; default: 0;
         *  Configures whether or not to enable PWM generator1 timer stamp B's shadow register
         *  update task receive.
         *  0: Disable
         *  1: Enable
         */
        uint32_t task_cmpr1_b_up_en:1;
        /** task_cmpr2_b_up_en : R/W; bitpos: [5]; default: 0;
         *  Configures whether or not to enable PWM generator2 timer stamp B's shadow register
         *  update task receive.
         *  0: Disable
         *  1: Enable
         */
        uint32_t task_cmpr2_b_up_en:1;
        /** task_gen_stop_en : R/W; bitpos: [6]; default: 0;
         *  Configures whether or not to enable all PWM generate stop task receive.
         *  0: Disable
         *  1: Enable
         */
        uint32_t task_gen_stop_en:1;
        /** task_timer0_sync_en : R/W; bitpos: [7]; default: 0;
         *  Configures whether or not to enable timer0 sync task receive.
         *  0: Disable
         *  1: Enable
         */
        uint32_t task_timer0_sync_en:1;
        /** task_timer1_sync_en : R/W; bitpos: [8]; default: 0;
         *  Configures whether or not to enable timer1 sync task receive.
         *  0: Disable
         *  1: Enable
         */
        uint32_t task_timer1_sync_en:1;
        /** task_timer2_sync_en : R/W; bitpos: [9]; default: 0;
         *  Configures whether or not to enable timer2 sync task receive.
         *  0: Disable
         *  1: Enable
         */
        uint32_t task_timer2_sync_en:1;
        /** task_timer0_period_up_en : R/W; bitpos: [10]; default: 0;
         *  Configures whether or not to enable timer0 period update task receive.
         *  0: Disable
         *  1: Enable
         */
        uint32_t task_timer0_period_up_en:1;
        /** task_timer1_period_up_en : R/W; bitpos: [11]; default: 0;
         *  Configures whether or not to enable timer1 period update task receive.
         *  0: Disable
         *  1: Enable
         */
        uint32_t task_timer1_period_up_en:1;
        /** task_timer2_period_up_en : R/W; bitpos: [12]; default: 0;
         *  Configures whether or not to enable timer2 period update task receive.
         *  0: Disable
         *  1: Enable
         */
        uint32_t task_timer2_period_up_en:1;
        /** task_tz0_ost_en : R/W; bitpos: [13]; default: 0;
         *  Configures whether or not to enable one shot trip0 task receive.
         *  0: Disable
         *  1: Enable
         */
        uint32_t task_tz0_ost_en:1;
        /** task_tz1_ost_en : R/W; bitpos: [14]; default: 0;
         *  Configures whether or not to enable one shot trip1 task receive.
         *  0: Disable
         *  1: Enable
         */
        uint32_t task_tz1_ost_en:1;
        /** task_tz2_ost_en : R/W; bitpos: [15]; default: 0;
         *  Configures whether or not to enable one shot trip2 task receive.
         *  0: Disable
         *  1: Enable
         */
        uint32_t task_tz2_ost_en:1;
        /** task_clr0_ost_en : R/W; bitpos: [16]; default: 0;
         *  Configures whether or not to enable one shot trip0 clear task receive.
         *  0: Disable
         *  1: Enable
         */
        uint32_t task_clr0_ost_en:1;
        /** task_clr1_ost_en : R/W; bitpos: [17]; default: 0;
         *  Configures whether or not to enable one shot trip1 clear task receive.
         *  0: Disable
         *  1: Enable
         */
        uint32_t task_clr1_ost_en:1;
        /** task_clr2_ost_en : R/W; bitpos: [18]; default: 0;
         *  Configures whether or not to enable one shot trip2 clear task receive.
         *  0: Disable
         *  1: Enable
         */
        uint32_t task_clr2_ost_en:1;
        /** task_cap0_en : R/W; bitpos: [19]; default: 0;
         *  Configures whether or not to enable capture0 task receive.
         *  0: Disable
         *  1: Enable
         */
        uint32_t task_cap0_en:1;
        /** task_cap1_en : R/W; bitpos: [20]; default: 0;
         *  Configures whether or not to enable capture1 task receive.
         *  0: Disable
         *  1: Enable
         */
        uint32_t task_cap1_en:1;
        /** task_cap2_en : R/W; bitpos: [21]; default: 0;
         *  Configures whether or not to enable capture2 task receive.
         *  0: Disable
         *  1: Enable
         */
        uint32_t task_cap2_en:1;
        /** task_timer0_a_up_en : R/W; bitpos: [22]; default: 0;
         *  Configures whether or not to enable timer0 timestamp a update task receive.
         *  0: Disable
         *  1: Enable
         */
        uint32_t task_timer0_a_up_en:1;
        /** task_timer1_a_up_en : R/W; bitpos: [23]; default: 0;
         *  Configures whether or not to enable timer1 timestamp a update task receive.
         *  0: Disable
         *  1: Enable
         */
        uint32_t task_timer1_a_up_en:1;
        /** task_timer2_a_up_en : R/W; bitpos: [24]; default: 0;
         *  Configures whether or not to enable timer2 timestamp a update task receive.
         *  0: Disable
         *  1: Enable
         */
        uint32_t task_timer2_a_up_en:1;
        /** task_timer0_b_up_en : R/W; bitpos: [25]; default: 0;
         *  Configures whether or not to enable timer0 timestamp b update task receive.
         *  0: Disable
         *  1: Enable
         */
        uint32_t task_timer0_b_up_en:1;
        /** task_timer1_b_up_en : R/W; bitpos: [26]; default: 0;
         *  Configures whether or not to enable timer1 timestamp b update task receive.
         *  0: Disable
         *  1: Enable
         */
        uint32_t task_timer1_b_up_en:1;
        /** task_timer2_b_up_en : R/W; bitpos: [27]; default: 0;
         *  Configures whether or not to enable timer2 timestamp b update task receive.
         *  0: Disable
         *  1: Enable
         */
        uint32_t task_timer2_b_up_en:1;
        uint32_t reserved_28:4;
    };
    uint32_t val;
} mcpwm_task_en_reg_t;

