espressif/esp-idf/components/soc/esp32s31/register/soc/mcpwm_struct.h
/** Type of evt_en2 register
 *  Event enable register2
 */
typedef union {
    struct {
        /** evt_op0_tee1_en : R/W; bitpos: [0]; default: 0;
         *  Configures whether or not to enable PWM generator0 timer equal OP0_TSTMP_E1_REG
         *  event generate.
         *  0: Disable
         *  1: Enable
         */
        uint32_t evt_op0_tee1_en:1;
        /** evt_op1_tee1_en : R/W; bitpos: [1]; default: 0;
         *  Configures whether or not to enable PWM generator1 timer equal OP1_TSTMP_E1_REG
         *  event generate.
         *  0: Disable
         *  1: Enable
         */
        uint32_t evt_op1_tee1_en:1;
        /** evt_op2_tee1_en : R/W; bitpos: [2]; default: 0;
         *  Configures whether or not to enable PWM generator2 timer equal OP2_TSTMP_E1_REG
         *  event generate.
         *  0: Disable
         *  1: Enable
         */
        uint32_t evt_op2_tee1_en:1;
        /** evt_op0_tee2_en : R/W; bitpos: [3]; default: 0;
         *  Configures whether or not to enable PWM generator0 timer equal OP0_TSTMP_E2_REG
         *  event generate.
         *  0: Disable
         *  1: Enable
         */
        uint32_t evt_op0_tee2_en:1;
        /** evt_op1_tee2_en : R/W; bitpos: [4]; default: 0;
         *  Configures whether or not to enable PWM generator1 timer equal OP1_TSTMP_E2_REG
         *  event generate.
         *  0: Disable
         *  1: Enable
         */
        uint32_t evt_op1_tee2_en:1;
        /** evt_op2_tee2_en : R/W; bitpos: [5]; default: 0;
         *  Configures whether or not to enable PWM generator2 timer equal OP2_TSTMP_E2_REG
         *  event generate.
         *  0: Disable
         *  1: Enable
         */
        uint32_t evt_op2_tee2_en:1;
        /** evt_timer0_tea_en : R/W; bitpos: [6]; default: 0;
         *  Configures whether or not to enable timer0 equal tea event generate.
         *  0: Disable
         *  1: Enable
         */
        uint32_t evt_timer0_tea_en:1;
        /** evt_timer1_tea_en : R/W; bitpos: [7]; default: 0;
         *  Configures whether or not to enable timer1 equal tea event generate.
         *  0: Disable
         *  1: Enable
         */
        uint32_t evt_timer1_tea_en:1;
        /** evt_timer2_tea_en : R/W; bitpos: [8]; default: 0;
         *  Configures whether or not to enable timer2 equal tea event generate.
         *  0: Disable
         *  1: Enable
         */
        uint32_t evt_timer2_tea_en:1;
        /** evt_timer0_teb_en : R/W; bitpos: [9]; default: 0;
         *  Configures whether or not to enable timer0 equal teb event generate.
         *  0: Disable
         *  1: Enable
         */
        uint32_t evt_timer0_teb_en:1;
        /** evt_timer1_teb_en : R/W; bitpos: [10]; default: 0;
         *  Configures whether or not to enable timer1 equal teb event generate.
         *  0: Disable
         *  1: Enable
         */
        uint32_t evt_timer1_teb_en:1;
        /** evt_timer2_teb_en : R/W; bitpos: [11]; default: 0;
         *  Configures whether or not to enable timer2 equal teb event generate.
         *  0: Disable
         *  1: Enable
         */
        uint32_t evt_timer2_teb_en:1;
        uint32_t reserved_12:20;
    };
    uint32_t val;
} mcpwm_evt_en2_reg_t;

/** Type of opn_tstmp register
 *  Operator timestamp register (unified type for array access)
 */
typedef union {
    struct {
        /** opn_tstmp_e : R/W; bitpos: [15:0]; default: 0;
         *  Configures the value of PWM operator timestamp.
         */
        uint32_t opn_tstmp_e:16;
        uint32_t reserved_16:16;
    };
    uint32_t val;
} mcpwm_opn_tstmp_reg_t;

/** Type of clk register
 *  Global configuration register
 */
typedef union {
    struct {
        /** clk_en : R/W; bitpos: [0]; default: 0;
         *  Configures whether or not to open register clock gate.
         *  0: Open the clock gate only when application writes registers
         *  1: Force open the clock gate for register
         */
        uint32_t clk_en:1;
        uint32_t reserved_1:31;
    };
    uint32_t val;
} mcpwm_clk_reg_t;

/** Type of timer_tstmp_cfg register
 *  PWM timern timestamp a configuration register. (unified type for array access)
 */
typedef union {
    struct {
        /** timern_tstmp : R/W; bitpos: [15:0]; default: 255;
         *  Configures the timestamp shadow of PWM timern
         */
        uint32_t timern_tstmp:16;
        /** timern_upmethod : R/W; bitpos: [17:16]; default: 0;
         *  Configures the update method for active register of PWM timern timestamp.
         *  0: Immediate
         *  1: TEZ
         *  2: Sync
         *  3: TEZ or sync
         *  TEZ here and below means timer equal zero event
         */
        uint32_t timern_upmethod:2;
        /** timern_dir : R/W; bitpos: [18]; default: 0;
         *  Configures the direction of the timer when timern value equal value for event
         *  trigger.
         *  0: up
         *  1: down
         */
        uint32_t timern_dir:1;
        uint32_t reserved_19:13;
    };
    uint32_t val;
} mcpwm_timern_tstmp_cfg_reg_t;


/** Group: Status register */
/** Type of timern_status register
 *  PWM timern status register.
 */
typedef union {
    struct {
        /** timern_value : RO; bitpos: [15:0]; default: 0;
         *  Represents current PWM timern counter value.
         */
        uint32_t timern_value:16;
        /** timern_direction : RO; bitpos: [16]; default: 0;
         *  Represents current PWM timern counter direction.
         *  0: Increment
         *  1: Decrement
         */
        uint32_t timern_direction:1;
        uint32_t reserved_17:15;
    };
    uint32_t val;
} mcpwm_timern_status_reg_t;

/** Type of fhn_status register
 *  Fault events status register
 */
typedef union {
    struct {
        /** tzn_cbc_on : RO; bitpos: [0]; default: 0;
         *  Represents whether or not an cycle-by-cycle mode action is on going.
         *  0:No action
         *  1: On going
         */
        uint32_t tzn_cbc_on:1;
        /** tzn_ost_on : RO; bitpos: [1]; default: 0;
         *  Represents whether or not an one-shot mode action is on going.
         *  0:No action
         *  1: On going
         */
        uint32_t tzn_ost_on:1;
        uint32_t reserved_2:30;
    };
    uint32_t val;
} mcpwm_fhn_status_reg_t;

/** Type of cap_chn register
 *  CAPn capture value register
 */
typedef union {
    struct {
        /** capn_value : RO; bitpos: [31:0]; default: 0;
         *  Represents value of last capture on CAPn
         */
        uint32_t capn_value:32;
    };
    uint32_t val;
} mcpwm_cap_chn_reg_t;

