espressif/esp-idf/components/soc/esp32s31/register/soc/mcpwm_struct.h
typedef struct {
    volatile mcpwm_timern_cfg0_reg_t timern_cfg0;
    volatile mcpwm_timern_cfg1_reg_t timern_cfg1;
    volatile mcpwm_timern_sync_reg_t timern_sync;
    volatile mcpwm_timern_status_reg_t timern_status;
} mcpwm_timer_regs_t;

typedef struct {
    volatile mcpwm_genn_stmp_cfg_reg_t gen_stmp_cfg;
    volatile mcpwm_genn_tstmp_reg_t timestamp[2];
    volatile mcpwm_genn_cfg0_reg_t gen_cfg0;
    volatile mcpwm_genn_force_reg_t gen_force;
    volatile mcpwm_genn_reg_t generator[2];
    volatile mcpwm_dtn_cfg_reg_t dt_cfg;
    volatile mcpwm_dtn_fed_cfg_reg_t dt_fed_cfg;
    volatile mcpwm_dtn_red_cfg_reg_t dt_red_cfg;
    volatile mcpwm_carriern_cfg_reg_t carrier_cfg;
    volatile mcpwm_fhn_cfg0_reg_t fh_cfg0;
    volatile mcpwm_fhn_cfg1_reg_t fh_cfg1;
    volatile mcpwm_fhn_status_reg_t fh_status;
} mcpwm_operator_reg_t;

typedef struct {
    volatile mcpwm_opn_tstmp_reg_t timestamp[2];
} mcpwm_operator_tstmp_reg_t;

typedef struct {
    volatile mcpwm_timern_tstmp_cfg_reg_t timer_tstmp_cfg[2];
} mcpwm_timer_tstmp_reg_t;

typedef struct mcpwm_dev_t {
    volatile mcpwm_timer_regs_t timer[3];
    volatile mcpwm_timer_synci_cfg_reg_t timer_synci_cfg;
    volatile mcpwm_operator_timersel_reg_t operator_timersel;
    volatile mcpwm_operator_reg_t operators[3];
    volatile mcpwm_fault_detect_reg_t fault_detect;
    volatile mcpwm_cap_timer_cfg_reg_t cap_timer_cfg;
    volatile mcpwm_cap_timer_phase_reg_t cap_timer_phase;
    volatile mcpwm_cap_chn_cfg_reg_t cap_chn_cfg[3];
    volatile mcpwm_cap_chn_reg_t cap_chn[3];
    volatile mcpwm_cap_status_reg_t cap_status;
    volatile mcpwm_update_cfg_reg_t update_cfg;
    volatile mcpwm_int_ena_reg_t int_ena;
    volatile mcpwm_int_raw_reg_t int_raw;
    volatile mcpwm_int_st_reg_t int_st;
    volatile mcpwm_int_clr_reg_t int_clr;
    volatile mcpwm_evt_en_reg_t evt_en;
    volatile mcpwm_task_en_reg_t task_en;
    volatile mcpwm_evt_en2_reg_t evt_en2;
    volatile mcpwm_operator_tstmp_reg_t operators_timestamp[3];
    volatile mcpwm_clk_reg_t clk;
    volatile mcpwm_version_reg_t version;
    uint32_t reserved_148;
    volatile mcpwm_timer_tstmp_reg_t timers_timestamp[3];
} mcpwm_dev_t;

extern mcpwm_dev_t MCPWM0;
extern mcpwm_dev_t MCPWM1;
extern mcpwm_dev_t MCPWM2;
extern mcpwm_dev_t MCPWM3;

#ifndef __cplusplus
_Static_assert(sizeof(mcpwm_dev_t) == 0x164, "Invalid size of mcpwm_dev_t structure");
#endif

#ifdef __cplusplus
}
#endif
